---
kind: property
id: P:Autodesk.Revit.DB.Structure.FabricSheet.HostId
source: html/f1c5db9c-4dfa-6f9e-3248-056b1460442a.htm
---
# Autodesk.Revit.DB.Structure.FabricSheet.HostId Property

The structure element that contains the Fabric Sheet.

## Syntax (C#)
```csharp
public ElementId HostId { get; }
```